02 Software/01 Broncode/operatiebrp-code-145.3/brp/test/brp-test-funqmachine/src/test/resources/xml/3-actual.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
            <brp:stuurgegevens>
                <brp:zendendePartij>199903</brp:zendendePartij>
                <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
                <brp:ontvangendePartij>017401</brp:ontvangendePartij>
                <brp:referentienummer>ab4adbce-e557-4dfc-9a58-f918ccae5584</brp:referentienummer>
                <brp:tijdstipVerzending>2014-08-01T13:38:01.645+02:00</brp:tijdstipVerzending>
            </brp:stuurgegevens>
            <brp:parameters>
                <brp:soortSynchronisatie>Volledigbericht</brp:soortSynchronisatie>
                <brp:abonnementNaam>Geen pop.bep. levering op basis van afnemerindicatie</brp:abonnementNaam>
                <brp:categorieDienst>Mutatielevering op basis van afnemerindicatie</brp:categorieDienst>
            </brp:parameters>
            <brp:synchronisatie brp:objecttype="AdministratieveHandeling">
                <brp:code>31001</brp:code>
                <brp:naam>Plaatsing afnemerindicatie</brp:naam>
                <brp:categorie>Actualisering</brp:categorie>
                <brp:partijCode>017401</brp:partijCode>
                <brp:tijdstipRegistratie>2014-08-01T13:38:01.644+02:00</brp:tijdstipRegistratie>
                <brp:bijgehoudenPersonen>
                    <brp:persoon brp:objecttype="Persoon" brp:communicatieID="1">
                        <brp:soortCode>I</brp:soortCode>
                        <brp:afgeleidAdministratief>
                            <brp:tijdstipRegistratie>2005-03-28T02:00:00.000+02:00</brp:tijdstipRegistratie>
                            <brp:actieInhoud>1994</brp:actieInhoud>
                            <brp:tijdstipLaatsteWijziging>2005-03-28T02:00:00.000+02:00</brp:tijdstipLaatsteWijziging>
                        </brp:afgeleidAdministratief>
                        <brp:identificatienummers>
                            <brp:tijdstipRegistratie>1981-10-02T01:00:00.000+01:00</brp:tijdstipRegistratie>
                            <brp:actieInhoud>1003</brp:actieInhoud>
                            <brp:datumAanvangGeldigheid>1981-10-02</brp:datumAanvangGeldigheid>
                            <brp:burgerservicenummer>677080426</brp:burgerservicenummer>
                            <brp:administratienummer>1097207412</brp:administratienummer>
                        </brp:identificatienummers>
                        <brp:samengesteldeNaam>
                            <brp:tijdstipRegistratie>1981-10-02T01:00:00.000+01:00</brp:tijdstipRegistratie>
                            <brp:actieInhoud>1003</brp:actieInhoud>
                            <brp:datumAanvangGeldigheid>1981-10-02</brp:datumAanvangGeldigheid>
                            <brp:indicatieAfgeleid>J</brp:indicatieAfgeleid>
                            <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
                            <brp:voornamen>Cees</brp:voornamen>
                            <brp:voorvoegsel>de</brp:voorvoegsel>
                            <brp:geslachtsnaamstam>Vries</brp:geslachtsnaamstam>
                        </brp:samengesteldeNaam>
                        <brp:geboorte>
                            <brp:tijdstipRegistratie>1981-10-02T01:00:00.000+01:00</brp:tijdstipRegistratie>
                            <brp:actieInhoud>1003</brp:actieInhoud>
                            <brp:datum>1981-10-02</brp:datum>
                            <brp:gemeenteCode>0519</brp:gemeenteCode>
                            <brp:woonplaatsnaam>Honselersdijk</brp:woonplaatsnaam>
                            <brp:omschrijvingLocatie>omschrijving geboorte locatie Cees</brp:omschrijvingLocatie>
                            <brp:landGebiedCode>6030</brp:landGebiedCode>
                        </brp:geboorte>
                        <brp:geslachtsaanduiding>
                            <brp:tijdstipRegistratie>1981-10-02T01:00:00.000+01:00</brp:tijdstipRegistratie>
                            <brp:actieInhoud>1003</brp:actieInhoud>
                            <brp:datumAanvangGeldigheid>1981-10-02</brp:datumAanvangGeldigheid>
                            <brp:code>V</brp:code>
                        </brp:geslachtsaanduiding>
                        <brp:inschrijving>
                            <brp:tijdstipRegistratie>1981-10-02T01:00:00.000+01:00</brp:tijdstipRegistratie>
                            <brp:actieInhoud>1003</brp:actieInhoud>
                            <brp:datum>1981-10-02</brp:datum>
                        </brp:inschrijving>
                        <brp:bijhouding>
                            <brp:tijdstipRegistratie>2005-03-28T02:00:00.000+02:00</brp:tijdstipRegistratie>
                            <brp:actieInhoud>1994</brp:actieInhoud>
                            <brp:datumAanvangGeldigheid>2005-03-28</brp:datumAanvangGeldigheid>
                            <brp:partijCode>034401</brp:partijCode>
                            <brp:bijhoudingsaardCode>I</brp:bijhoudingsaardCode>
                            <brp:nadereBijhoudingsaardCode>A</brp:nadereBijhoudingsaardCode>
                            <brp:indicatieOnverwerktDocumentAanwezig>N</brp:indicatieOnverwerktDocumentAanwezig>
                        </brp:bijhouding>
                        <brp:voornamen>
                            <brp:voornaam brp:objecttype="PersoonVoornaam">
                                <brp:tijdstipRegistratie>1981-10-02T01:00:00.000+01:00</brp:tijdstipRegistratie>
                                <brp:actieInhoud>1003</brp:actieInhoud>
                                <brp:datumAanvangGeldigheid>1981-10-02</brp:datumAanvangGeldigheid>
                                <brp:volgnummer>1</brp:volgnummer>
                                <brp:naam>Cees</brp:naam>
                            </brp:voornaam>
                            <brp:voornaam brp:objecttype="PersoonVoornaam">
                                <brp:tijdstipRegistratie>1981-10-02T01:00:00.000+01:00</brp:tijdstipRegistratie>
                                <brp:actieInhoud>1003</brp:actieInhoud>
                                <brp:datumAanvangGeldigheid>1981-10-02</brp:datumAanvangGeldigheid>
                                <brp:volgnummer>2</brp:volgnummer>
                                <brp:naam>Peter</brp:naam>
                            </brp:voornaam>
                        </brp:voornamen>
                        <brp:geslachtsnaamcomponenten>
                            <brp:geslachtsnaamcomponent brp:objecttype="PersoonGeslachtsnaamcomponent">
                                <brp:tijdstipRegistratie>1981-10-02T01:00:00.000+01:00</brp:tijdstipRegistratie>
                                <brp:actieInhoud>1003</brp:actieInhoud>
                                <brp:datumAanvangGeldigheid>1981-10-02</brp:datumAanvangGeldigheid>
                                <brp:volgnummer>1</brp:volgnummer>
                                <brp:voorvoegsel>de</brp:voorvoegsel>
                                <brp:scheidingsteken>-</brp:scheidingsteken>
                                <brp:stam>Vries</brp:stam>
                            </brp:geslachtsnaamcomponent>
                            <brp:geslachtsnaamcomponent brp:objecttype="PersoonGeslachtsnaamcomponent">
                                <brp:tijdstipRegistratie>1981-10-02T01:00:00.000+01:00</brp:tijdstipRegistratie>
                                <brp:actieInhoud>1003</brp:actieInhoud>
                                <brp:datumAanvangGeldigheid>1981-10-02</brp:datumAanvangGeldigheid>
                                <brp:volgnummer>2</brp:volgnummer>
                                <brp:voorvoegsel>de</brp:voorvoegsel>
                                <brp:scheidingsteken>-</brp:scheidingsteken>
                                <brp:stam>Rooij</brp:stam>
                            </brp:geslachtsnaamcomponent>
                        </brp:geslachtsnaamcomponenten>
                        <brp:naamgebruik>
                            <brp:tijdstipRegistratie>1981-10-02T01:00:00.000+01:00</brp:tijdstipRegistratie>
                            <brp:actieInhoud>1003</brp:actieInhoud>
                            <brp:code>E</brp:code>
                            <brp:indicatieAfgeleid>J</brp:indicatieAfgeleid>
                            <brp:voornamen>Cees</brp:voornamen>
                            <brp:voorvoegsel>de</brp:voorvoegsel>
                            <brp:scheidingsteken>-</brp:scheidingsteken>
                            <brp:geslachtsnaamstam>Vries</brp:geslachtsnaamstam>
                        </brp:naamgebruik>
                        <brp:adressen>
                            <brp:adres brp:objecttype="PersoonAdres">
                                <brp:tijdstipRegistratie>2005-03-28T02:00:00.000+02:00</brp:tijdstipRegistratie>
                                <brp:actieInhoud>1994</brp:actieInhoud>
                                <brp:datumAanvangGeldigheid>2005-03-28</brp:datumAanvangGeldigheid>
                                <brp:soortCode>W</brp:soortCode>
                                <brp:redenWijzigingCode>P</brp:redenWijzigingCode>
                                <brp:aangeverAdreshoudingCode>P</brp:aangeverAdreshoudingCode>
                                <brp:datumAanvangAdreshouding>2005-03-28</brp:datumAanvangAdreshouding>
                                <brp:gemeenteCode>0344</brp:gemeenteCode>
                                <brp:naamOpenbareRuimte>Vredenburg</brp:naamOpenbareRuimte>
                                <brp:afgekorteNaamOpenbareRuimte>Vredenburg</brp:afgekorteNaamOpenbareRuimte>
                                <brp:huisnummer>3</brp:huisnummer>
                                <brp:postcode>3511BA</brp:postcode>
                                <brp:woonplaatsnaam>Utrecht</brp:woonplaatsnaam>
                                <brp:landGebiedCode>6030</brp:landGebiedCode>
                            </brp:adres>
                        </brp:adressen>
                        <brp:nationaliteiten>
                            <brp:nationaliteit brp:objecttype="PersoonNationaliteit">
                                <brp:tijdstipRegistratie>1981-10-02T01:00:00.000+01:00</brp:tijdstipRegistratie>
                                <brp:actieInhoud>1003</brp:actieInhoud>
                                <brp:datumAanvangGeldigheid>1981-10-02</brp:datumAanvangGeldigheid>
                                <brp:nationaliteitCode>0001</brp:nationaliteitCode>
                                <brp:redenVerkrijgingCode>017</brp:redenVerkrijgingCode>
                            </brp:nationaliteit>
                            <brp:nationaliteit brp:objecttype="PersoonNationaliteit">
                                <brp:tijdstipRegistratie>1981-10-02T01:00:00.000+01:00</brp:tijdstipRegistratie>
                                <brp:actieInhoud>1003</brp:actieInhoud>
                                <brp:datumAanvangGeldigheid>1981-10-02</brp:datumAanvangGeldigheid>
                                <brp:nationaliteitCode>0002</brp:nationaliteitCode>
                                <brp:redenVerkrijgingCode>017</brp:redenVerkrijgingCode>
                            </brp:nationaliteit>
                        </brp:nationaliteiten>
                        <brp:betrokkenheden>
                            <brp:kind brp:objecttype="Betrokkenheid">
                                <brp:familierechtelijkeBetrekking brp:objecttype="Relatie">
                                    <brp:betrokkenheden>
                                        <brp:ouder brp:objecttype="Betrokkenheid">
                                            <brp:persoon brp:objecttype="Persoon">
                                                <brp:soortCode>N</brp:soortCode>
                                                <brp:samengesteldeNaam>
                                                    <brp:tijdstipRegistratie>2014-08-01T10:53:00.770+02:00</brp:tijdstipRegistratie>
                                                    <brp:datumAanvangGeldigheid>1998-01-01</brp:datumAanvangGeldigheid>
                                                    <brp:indicatieAfgeleid>J</brp:indicatieAfgeleid>
                                                    <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
                                                    <brp:voornamen>Adam-Cees</brp:voornamen>
                                                    <brp:voorvoegsel>van</brp:voorvoegsel>
                                                    <brp:scheidingsteken>-</brp:scheidingsteken>
                                                    <brp:geslachtsnaamstam>Modernodam</brp:geslachtsnaamstam>
                                                </brp:samengesteldeNaam>
                                                <brp:geboorte>
                                                    <brp:tijdstipRegistratie>2014-08-01T10:53:00.770+02:00</brp:tijdstipRegistratie>
                                                    <brp:datum>1950-01-01</brp:datum>
                                                    <brp:landGebiedCode>6030</brp:landGebiedCode>
                                                </brp:geboorte>
                                                <brp:geslachtsaanduiding>
                                                    <brp:tijdstipRegistratie>2014-08-01T10:53:00.770+02:00</brp:tijdstipRegistratie>
                                                    <brp:datumAanvangGeldigheid>1950-01-01</brp:datumAanvangGeldigheid>
                                                    <brp:code>M</brp:code>
                                                </brp:geslachtsaanduiding>
                                            </brp:persoon>
                                            <brp:ouderschap>
                                                <brp:tijdstipRegistratie>1981-10-02T01:00:00.000+01:00</brp:tijdstipRegistratie>
                                                <brp:actieInhoud>1003</brp:actieInhoud>
                                                <brp:datumAanvangGeldigheid>1981-10-02</brp:datumAanvangGeldigheid>
                                            </brp:ouderschap>
                                        </brp:ouder>
                                        <brp:ouder brp:objecttype="Betrokkenheid">
                                            <brp:persoon brp:objecttype="Persoon">
                                                <brp:soortCode>N</brp:soortCode>
                                                <brp:samengesteldeNaam>
                                                    <brp:tijdstipRegistratie>2014-08-01T10:53:00.939+02:00</brp:tijdstipRegistratie>
                                                    <brp:datumAanvangGeldigheid>1998-01-01</brp:datumAanvangGeldigheid>
                                                    <brp:indicatieAfgeleid>J</brp:indicatieAfgeleid>
                                                    <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
                                                    <brp:voornamen>Eva-Cees</brp:voornamen>
                                                    <brp:voorvoegsel>van</brp:voorvoegsel>
                                                    <brp:scheidingsteken>-</brp:scheidingsteken>
                                                    <brp:geslachtsnaamstam>Modernodam</brp:geslachtsnaamstam>
                                                </brp:samengesteldeNaam>
                                                <brp:geboorte>
                                                    <brp:tijdstipRegistratie>2014-08-01T10:53:00.939+02:00</brp:tijdstipRegistratie>
                                                    <brp:datum>1950-01-01</brp:datum>
                                                    <brp:landGebiedCode>6030</brp:landGebiedCode>
                                                </brp:geboorte>
                                                <brp:geslachtsaanduiding>
                                                    <brp:tijdstipRegistratie>2014-08-01T10:53:00.939+02:00</brp:tijdstipRegistratie>
                                                    <brp:datumAanvangGeldigheid>1950-01-01</brp:datumAanvangGeldigheid>
                                                    <brp:code>V</brp:code>
                                                </brp:geslachtsaanduiding>
                                            </brp:persoon>
                                            <brp:ouderschap>
                                                <brp:tijdstipRegistratie>1981-10-02T01:00:00.000+01:00</brp:tijdstipRegistratie>
                                                <brp:actieInhoud>1003</brp:actieInhoud>
                                                <brp:datumAanvangGeldigheid>1981-10-02</brp:datumAanvangGeldigheid>
                                            </brp:ouderschap>
                                        </brp:ouder>
                                    </brp:betrokkenheden>
                                </brp:familierechtelijkeBetrekking>
                            </brp:kind>
                        </brp:betrokkenheden>
                        <brp:administratieveHandelingen>
                            <brp:administratieveHandeling brp:objecttype="AdministratieveHandeling">
                                <brp:code>04009</brp:code>
                                <brp:naam>Omzetting geregistreerd partnerschap in huwelijk</brp:naam>
                                <brp:categorie>Actualisering</brp:categorie>
                                <brp:partijCode>199902</brp:partijCode>
                                <brp:tijdstipRegistratie>2005-03-28T02:00:00.000+02:00</brp:tijdstipRegistratie>
                                <brp:bijgehoudenActies>
                                    <brp:actie brp:objecttype="Actie" brp:objectSleutel="actie1994">
                                        <brp:soortNaam>Registratie geboorte</brp:soortNaam>
                                        <brp:bronnen/>
                                    </brp:actie>
                                </brp:bijgehoudenActies>
                            </brp:administratieveHandeling>
                            <brp:administratieveHandeling brp:objecttype="AdministratieveHandeling">
                                <brp:code>04009</brp:code>
                                <brp:naam>Omzetting geregistreerd partnerschap in huwelijk</brp:naam>
                                <brp:categorie>Actualisering</brp:categorie>
                                <brp:partijCode>199902</brp:partijCode>
                                <brp:tijdstipRegistratie>2005-03-28T02:00:00.000+02:00</brp:tijdstipRegistratie>
                                <brp:bijgehoudenActies>
                                    <brp:actie brp:objecttype="Actie" brp:objectSleutel="actie1994">
                                        <brp:soortNaam>Registratie geboorte</brp:soortNaam>
                                        <brp:bronnen/>
                                    </brp:actie>
                                </brp:bijgehoudenActies>
                            </brp:administratieveHandeling>
                        </brp:administratieveHandelingen>
                    </brp:persoon>
                </brp:bijgehoudenPersonen>
            </brp:synchronisatie>
        </brp:lvg_synVerwerkPersoon>
    </soap:Body>
</soap:Envelope>
