2016/brp 2016-02-09/test/testcases/legacy/src/main/resources/testcases/art_input_Attendering/data/AttenderingMetPlaatsingAfnemerindicatie-TC03-1-dataresponse.xml

<Results>
    <ResultSet fetchSize="0">
        <Row rowNumber="1">
            <ID>*</ID>
            <ABONNEMENT>5670032</ABONNEMENT>
            <DATA><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
  <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
  <brp:stuurgegevens>
    <brp:zendendePartij>*</brp:zendendePartij>
    <brp:zendendeSysteem>*</brp:zendendeSysteem>
    <brp:ontvangendePartij>505002</brp:ontvangendePartij>
    <brp:ontvangendeSysteem>*</brp:ontvangendeSysteem>
    <brp:referentienummer>*</brp:referentienummer>
    <brp:tijdstipVerzending>*</brp:tijdstipVerzending>
  </brp:stuurgegevens>
  <brp:parameters>
    <brp:soortSynchronisatie>Volledigbericht</brp:soortSynchronisatie>
    <brp:abonnementNaam>Mutaties op geselecteerde personen voor afnemer = 505002</brp:abonnementNaam>
    <brp:categorieDienst>Attendering</brp:categorieDienst>
    <brp:effectAfnemerindicatie>Plaatsing</brp:effectAfnemerindicatie>
  </brp:parameters>
  <brp:synchronisatie brp:objecttype="AdministratieveHandeling">
    <brp:code>*</brp:code>
    <brp:naam>Verkrijging Nederlandse nationaliteit</brp:naam>
    <brp:categorie>*</brp:categorie>
    <brp:partijCode>*</brp:partijCode>
    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
    <brp:bijgehoudenPersonen>
      <brp:persoon brp:objecttype="Persoon" brp:communicatieID="*">
        <brp:soortCode>*</brp:soortCode>
        <brp:afgeleidAdministratief brp:voorkomenSleutel="*">*</brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:voorkomenSleutel="*">*</brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:voorkomenSleutel="*">*</brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:voorkomenSleutel="*">*</brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:voorkomenSleutel="*">*</brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:voorkomenSleutel="*">*</brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:voorkomenSleutel="*">*</brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:voorkomenSleutel="*">*</brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:voorkomenSleutel="*">*</brp:afgeleidAdministratief>
        <brp:identificatienummers brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
          <brp:burgerservicenummer>210010939</brp:burgerservicenummer>
          <brp:administratienummer>7504821935</brp:administratienummer>
        </brp:identificatienummers>
        <brp:samengesteldeNaam brp:voorkomenSleutel="*">*</brp:samengesteldeNaam>
        <brp:samengesteldeNaam brp:voorkomenSleutel="*">*</brp:samengesteldeNaam>
        <brp:samengesteldeNaam brp:voorkomenSleutel="*">*</brp:samengesteldeNaam>
        <brp:samengesteldeNaam brp:voorkomenSleutel="*">*</brp:samengesteldeNaam>
        <brp:samengesteldeNaam brp:voorkomenSleutel="*">*</brp:samengesteldeNaam>
        <brp:geboorte brp:voorkomenSleutel="*">*</brp:geboorte>
        <brp:geslachtsaanduiding brp:voorkomenSleutel="*">*</brp:geslachtsaanduiding>
        <brp:inschrijving brp:voorkomenSleutel="*">*</brp:inschrijving>
        <brp:bijhouding brp:voorkomenSleutel="*">*</brp:bijhouding>
        <brp:bijhouding brp:voorkomenSleutel="*">*</brp:bijhouding>
        <brp:bijhouding brp:voorkomenSleutel="*">*</brp:bijhouding>
        <brp:bijhouding brp:voorkomenSleutel="*">*</brp:bijhouding>
        <brp:bijhouding brp:voorkomenSleutel="*">*</brp:bijhouding>
        <brp:voornamen>*</brp:voornamen>
        <brp:geslachtsnaamcomponenten>
          <brp:geslachtsnaamcomponent brp:objecttype="PersoonGeslachtsnaamcomponent" brp:voorkomenSleutel="*">*</brp:geslachtsnaamcomponent>
        </brp:geslachtsnaamcomponenten>
        <brp:naamgebruik brp:voorkomenSleutel="*">*</brp:naamgebruik>
        <brp:naamgebruik brp:voorkomenSleutel="*">*</brp:naamgebruik>
        <brp:naamgebruik brp:voorkomenSleutel="*">*</brp:naamgebruik>
        <brp:naamgebruik brp:voorkomenSleutel="*">*</brp:naamgebruik>
        <brp:adressen>*</brp:adressen>
        <brp:nationaliteiten>*</brp:nationaliteiten>
        <brp:betrokkenheden>
          <brp:kind brp:objecttype="Betrokkenheid" brp:objectSleutel="*" brp:voorkomenSleutel="*">
            <brp:familierechtelijkeBetrekking brp:objecttype="Relatie" brp:objectSleutel="*">
              <brp:betrokkenheden>
                <brp:ouder brp:objecttype="Betrokkenheid" brp:objectSleutel="*" brp:voorkomenSleutel="*">
                  <brp:persoon brp:objecttype="Persoon">
                    <brp:soortCode>*</brp:soortCode>
                    <brp:samengesteldeNaam brp:voorkomenSleutel="*">*</brp:samengesteldeNaam>
                    <brp:geboorte brp:voorkomenSleutel="*">*</brp:geboorte>
                    <brp:geslachtsaanduiding brp:voorkomenSleutel="*">*</brp:geslachtsaanduiding>
                  </brp:persoon>
                  <brp:ouderschap brp:voorkomenSleutel="*">*</brp:ouderschap>
                </brp:ouder>
                <brp:ouder brp:objecttype="Betrokkenheid" brp:objectSleutel="*" brp:voorkomenSleutel="*">
                  <brp:persoon brp:objecttype="Persoon">
                    <brp:soortCode>*</brp:soortCode>
                    <brp:samengesteldeNaam brp:voorkomenSleutel="*">*</brp:samengesteldeNaam>
                    <brp:geboorte brp:voorkomenSleutel="*">*</brp:geboorte>
                    <brp:geslachtsaanduiding brp:voorkomenSleutel="*"></brp:geslachtsaanduiding>
                  </brp:persoon>
                  <brp:ouderschap brp:voorkomenSleutel="*">*</brp:ouderschap>
                </brp:ouder>
              </brp:betrokkenheden>
            </brp:familierechtelijkeBetrekking>
          </brp:kind>
          <brp:partner brp:objecttype="Betrokkenheid" brp:voorkomenSleutel="*" brp:objectSleutel="*">
            <brp:huwelijk brp:objecttype="Relatie" brp:objectSleutel="*">
              <brp:betrokkenheden>
                <brp:partner brp:objecttype="Betrokkenheid" brp:voorkomenSleutel="*" brp:objectSleutel="*">
                  <brp:persoon brp:objecttype="Persoon">
                    <brp:soortCode>I</brp:soortCode>
                    <brp:identificatienummers brp:voorkomenSleutel="*">*</brp:identificatienummers>
                    <brp:samengesteldeNaam brp:voorkomenSleutel="*">*</brp:samengesteldeNaam>
                    <brp:geboorte brp:voorkomenSleutel="*">*</brp:geboorte>
                    <brp:geslachtsaanduiding brp:voorkomenSleutel="*">*</brp:geslachtsaanduiding>
                  </brp:persoon>
                </brp:partner>
              </brp:betrokkenheden>
              <brp:relatie brp:voorkomenSleutel="*">*</brp:relatie>
            </brp:huwelijk>
          </brp:partner>
        </brp:betrokkenheden>
        <brp:deelnameEUVerkiezingen brp:voorkomenSleutel="*">*</brp:deelnameEUVerkiezingen>
        <brp:administratieveHandelingen>*</brp:administratieveHandelingen>
      </brp:persoon>
    </brp:bijgehoudenPersonen>
  </brp:synchronisatie>
</brp:lvg_synVerwerkPersoon>
  </soap:Body>
</soap:Envelope></DATA>
        </Row>
    </ResultSet>
</Results>